# Series

In [6]:
import numpy as np

In [7]:
import pandas as pd

In [8]:
aa = [1, 2, 3, 4]
ab = (5, 6, 7, 8)
ac = {9, 10, 11, 12}
ad = {'first': 13, 'second': 14, 'third': 15, 'fourth': 16}

print("aa:", aa)
print("ab:", ab)
print("ac:", ac)
print("ad:", ad)

aa: [1, 2, 3, 4]
ab: (5, 6, 7, 8)
ac: {9, 10, 11, 12}
ad: {'first': 13, 'second': 14, 'third': 15, 'fourth': 16}

In [9]:
ser1 = pd.Series(aa)
ser2 = pd.Series(ab)
ser3 = pd.Series(list(ac))
ser4 = pd.Series(ad)

print("ser1 (from list aa):")
print(ser1)
print("\nser2 (from tuple ab):")
print(ser2)
print("\nser3 (from set ac):")
print(ser3)
print("\nser4 (from dictionary ad):")
print(ser4)

ser1 (from list aa):
0    1
1    2
2    3
3    4
dtype: int64

ser2 (from tuple ab):
0    5
1    6
2    7
3    8
dtype: int64

ser3 (from set ac):
0     9
1    10
2    11
3    12
dtype: int64

ser4 (from dictionary ad):
first     13
second    14
third     15
fourth    16
dtype: int64

In [5]:
ser5 = pd.Series(17, 18, 19, 20)

# This results in a error because 'pd.series' expects a single argument as the data source. In a sense the data type is not understood.
# pd.series expects either a single iterable or an index-value pair but not multiple arguments.

TypeError: Index(...) must be called with a collection of some kind, 18 was passed

# DataFrames from Series

In [10]:
df1 = pd.DataFrame(ser1)

In [11]:
df1

   0
0  1
1  2
2  3
3  4

In [12]:
df1.insert(1, 'Column2', ser2)
df1.insert(2, 'Column3', ser3)
df1

   0  Column2  Column3
0  1        5        9
1  2        6       10
2  3        7       11
3  4        8       12

In [13]:
df1['Column4'] = ser4
df1

# Index labels do not match or align with the previous rows. Ser4 has a custom index causing the new column to fill NaN values for their rows.

   0  Column2  Column3  Column4
0  1        5        9      NaN
1  2        6       10      NaN
2  3        7       11      NaN
3  4        8       12      NaN

In [14]:
df1.loc[4] = [5, 9, 12, 0]
df1

   0  Column2  Column3  Column4
0  1        5        9      NaN
1  2        6       10      NaN
2  3        7       11      NaN
3  4        8       12      NaN
4  5        9       12      0.0

# Reading Data into a DataFrame

In [16]:
df2 = pd.read_csv('sakila_example.csv')
df2

,title,description,category,language,actor_name
0,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,Documentary,English,PENELOPE GUINESS
1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,Documentary,English,CHRISTIAN GABLE
2,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,Documentary,English,LUCILLE TRACY
3,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,Documentary,English,SANDRA PECK
4,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,Documentary,English,JOHNNY CAGE
...,...,...,...,...,...
257,ATTRACTION NEWTON,A Astounding Panorama of a Composer And a Fris...,New,English,GARY PENN
258,ATTRACTION NEWTON,A Astounding Panorama of a Composer And a Fris...,New,English,CHRISTOPHER WEST
259,AUTUMN CROW,A Beautiful Tale of a Dentist And a Mad Cow wh...,Games,English,DUSTIN TAUTOU
260,AUTUMN CROW,A Beautiful Tale of a Dentist And a Mad Cow wh...,Games,English,ANGELA HUDSON
261,AUTUMN CROW,A Beautiful Tale of a Dentist And a Mad Cow wh...,Games,English,JAMES PITT